{
  "network_grps": {
    "title": "Configure networks",
    "intro": "Below is a list of network groups and associated networks. Each network group carries a certain type of traffic. Review the details of the networks below to ensure that they match your environment. You will need to provide at least one network for each network group.",
    "step": "Configure networks",
    "delete_msg": "Are you sure you want to delete this network {{row.name}}?",
    "delete_title": "Delete network",

    "help": {
      "p1": "A network-group defines the traffic separation model and all of the properties that are common to the set of L3 networks that carry each type of traffic. They define where services are attached to the network model and the routing within that model.",
      "p2": "You must add at least one network to each network group on this page before you can proceed.",
      "p3": "Note that the Management network is an untagged VLAN while the others are tagged so that packets contain the ID of the VLAN.",
      "p4": "As part of the Ardana deployment, networks are configured to act as the default route for all traffic that was received via that network (so that response packets always return via the network the request came from).",
      "p5": "Note that Ardana will configure the routing rules on the servers it deploys, but ensuring that gateways can provide the required routes is the responsibility of your network configuration.",
      "p6": "The network separation enabled by Ardana OpenStack 5.0 provides a number of advantages, including increased isolation, enhanced security, and more efficient network traffic."
    },

    "drawer_help": {
      "cidr": "CIDR notation is a syntax for specifying IP addresses and their associated routing prefix. Enter yours here.",
      "vlan": "The ID assigned to this VLAN when it was originally created"
    },

    "error": {
      "valid_yaml": "Must be valid YAML"
    },

    "edit": "Edit network group tags",

    "btn.add": "Add network",
    "btn.edit": "Edit network",
    "btn.edit_group": "Edit network group tags",
    "btn.delete": "Delete network",

    "name": "Network group",
    "tags": "Network tags",
    "network_name": "Network name",
    "vlan": "VLAN ID",
    "cidr": "CIDR",
    "gateway": "Gateway",
    "tagged_vlan": "Tagged VLAN",
    "ip_range": "IP range",
    "ip_range_from": "IP range : From",
    "ip_range_to": "IP range : To"
  }
}
