{
  "success": {
    "title": "Congratulations!",

    "p1": "Your Ardana OpenStack cloud is now installed.",
    "p2": "You may check the installation by running the included Tempest tests:",
    "p3": "<samp class=\"example-code\">cd ~/scratch/ansible/next/ardana/ansible<samp/><br/><samp class=\"example-code\">ansible-playbook -i hosts/verb_hosts tempest-run.yml</samp>",
    "p4_0": "If you chose to install VSA, continue to the VSA installation instructions on the Ardana OpenStack documentation site under <a href=\"http://www.docslinkgoeshere.com/version/cinder_vsa\" target=\"_blank\">Configuring for VSA Block Storage Backend</a>.",
    "p4_1": "If you chose to install Ceph, continue to the Ceph installation instructions on the Ardana OpenStack documentation site under <a href=\"http://www.docslinkgoeshere.com/version/installation/configure_ceph\" target=\"_blank\">Configuring for Ceph Block Storage Backend</a>.",
    "p5": "If you have installed your cloud on ESX, further required steps are explained in the <a href=\"http://www.docslinkgoeshere.com/version/bare_installation_esx\" target=\"_blank\">ESX installation document</a>.",
    "p6": "If you are ready to manage your cloud, add tenants, etc, visit the Horizon dashboard. Horizon is a browser-based user interface that allows you to interact with the Ardana OpenStack cloud. The UI elements are grouped into dashboards, including Project, Admin and Settings.",
    "p7": "To access the dashboard, enter the Horizon dashboard URL in a supported browser and log in.",
    "p8": "You may also want to access the Operations Console (OpsConsole). Currently, OpsConsole is used for monitoring. The Monasca Monitoring service is exposed via OpsConsole. It can be accessed by clicking the button below.",
    "p9": "For more details on the use of the Operations Console, see the <a href=\"http://www.docslinkgoeshere.com/version/monasca_opsconsole_overview\" target=\"_blank\">Operations Console Overview</a>.",
    "p10": "More information on Monasca can be found in the <a href=\"http://www.docslinkgoeshere.com/version/monasca\" target=\"_blank\">Monasca documentation</a>.",
    "p11": "To connect the identity service to your LDAP services, see the <a href=\"http://www.docslinkgoeshere.com/version/identity/identity_ldap\" target=\"_blank\">LDAP Integration</a> documentation.",

    "btn.opsConsole": "Access Ops Console"
  }
}
